import { Container, Stack, Typography } from "@mui/material";
import Image from "next/image";

export const ServiceCondition = () => {
  return (
    <Container>
      <Stack py={4} gap={4}>
        <Stack direction={"row"} gap={1}>
          <Image src={"/star.png"} alt="" width={32} height={32} />
          <Typography fontSize={22} fontWeight={700}>
            Үйлчилгээний нөхцөл
          </Typography>
        </Stack>

        <Typography fontSize={18} fontWeight={400}>
          Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
          ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
          худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.{" "}
          <br></br>
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ. <br></br> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars
          Lab /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
          хамтран хяналт тавина. <br></br> Mstars Food delivery нь Mstars Lab
          компанийн интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл,
          журам нь уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой
          үүсэх харилцааг зохицуулахад оршино. <br></br> Энэхүү нөхцөл нь
          хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн
          зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ. <br></br> Энэхүү
          үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/
          болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.{" "}
          <br></br> Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ. <br></br> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars
          Lab /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
          хамтран хяналт тавина. <br></br> Mstars Food delivery нь Mstars Lab
          компанийн интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл,
          журам нь уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой
          үүсэх харилцааг зохицуулахад оршино. <br></br> Энэхүү нөхцөл нь
          хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн
          зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ.<br></br> Энэхүү
          үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/
          болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.{" "}
          <br></br> Mstars Food delivery нь Mstars Lab компанийн интернэт
          худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг
          вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх
          харилцааг зохицуулахад оршино.<br></br> Энэхүү нөхцөл нь хэрэглэгч
          худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч
          баталгаажуулсаны үндсэн дээр хэрэгжинэ.<br></br> Энэхүү үйлчилгээний
          нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон
          хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.<br></br>{" "}
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ.<br></br> Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars
          Lab /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
          хамтран хяналт тавина.
        </Typography>
      </Stack>
    </Container>
  );
};
